---
kind: property
id: P:Autodesk.Revit.DB.MEPSystemType.FillColor
source: html/1b4309e7-bdf4-807a-a13a-6dcef6a94b50.htm
---
# Autodesk.Revit.DB.MEPSystemType.FillColor Property

Indicates the color that should override the fill color for all components in the system.

## Syntax (C#)
```csharp
public Color FillColor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null